artillery/config.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 100
      name: "Low load phase"
    - duration: 15
      arrivalRate: 0
      name: "Cool-down period"

    - duration: 60
      arrivalRate: 500
      name: "Medium load phase"
    - duration: 15
      arrivalRate: 0
      name: "Cool-down period"

    - duration: 60
      arrivalRate: 1000
      name: "High load phase"
    - duration: 15
      arrivalRate: 0
      name: "Cool-down period"
  plugins:
    metrics-by-endpoint: {}
  processor: "./processor.js"
  
scenarios:
  - name: "Basic Endpoints Test"
    flow:
      - get:
          url: "/ping"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - think: 1
      
      - get:
          url: "/compute"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - think: 1
      
      - get:
          url: "/memory"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - think: 1
      
      - get:
          url: "/bulk"
          expect:
            - statusCode: 200
            - contentType: "application/json"
      - think: 1